drafts/2025-12-26-why-haskell-is-my-language-of-choice.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 27 March 2026 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Why Haskell is my language of choice</title>
<meta name="author" content="doyougnu" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Why Haskell is my language of choice</h1>
<p>
tl;dr: Haskell is my language of choice because it is best in class in exploring
the algebraic nature of the system I am building.
</p>

<p>
There are two pieces of media that revolutionized my philosophy of my
craft. First, is Jonathon Blow&rsquo;s talk in 2019 on the collapse of civilization
and second is Conal Elliot&rsquo;s appearance on the type theory forall podcast.
Blow&rsquo;s thesis is that without direct, consistent effort technology and
technological know-how will decay. But in this talk, he describes game
development as a <code>craft</code> and then states
</p>


<p>
Elliot&rsquo;s thesis is that the act of programming is the
construction of a device that allows us to peer into a platonic world of
computation. His employs a microscope as a metaphor; the microscope is a device
that we have built and it is only with that device that we discover, explore,
and analyze the microscopic world. Similarly, a program is a device that we
build that allows us to discover, explore and analyze the world of computation.
</p>

<p>
Let&rsquo;s go through a worked example. Imagine you are trying to build something,
anything, say a calculator app.
</p>
<div id="outline-container-orgc0f6098" class="outline-2">
<h2 id="orgc0f6098">Type theory forall podcast</h2>
</div>

<div id="outline-container-orgbda4b8a" class="outline-2">
<h2 id="orgbda4b8a">microscopes</h2>
</div>

<div id="outline-container-org42468de" class="outline-2">
<h2 id="org42468de">types as exploration</h2>
</div>

<div id="outline-container-org40d0312" class="outline-2">
<h2 id="org40d0312">A push towards the algebraic</h2>
</div>

<div id="outline-container-org2c0e1fe" class="outline-2">
<h2 id="org2c0e1fe"><span class="todo TODO">TODO</span> link the podcast</h2>
</div>

<div id="outline-container-org00a5a07" class="outline-2">
<h2 id="org00a5a07"><span class="todo TODO">TODO</span> link conal&rsquo;s page</h2>
</div>
</div>
<div id="postamble" class="status">
<hr>
               <div class='author-info' style='text-align:center; margin-top: 2em; font-style: italic;'>
                 Written by <a href='/me.html' class='author-link'>doyougnu</a>
                 on <span class='timestamp'>2025-12-26</span>
               </div>
               <div class='botnav' style='text-align:center; margin-top: 2em;'>
                  <a href='/index.html'>Blog</a>
                  <a href='/publications.html'>Publications</a>
                  <a href='https://github.com/doyougnu'>Github</a>
                  <a href='/me.html'>About</a>
               </div>
</div>
</body>
</html>
